In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. ISO 8601
### Exercises
Which date format below conforms to the ISO 8601 standard?

Answer the question

### Possible Answers
- A. June 15, 2018 3:30pm
- B. 2018-06-15 15:30:00
- C. 6/15/18 13:00
- D. 2018-6-15 3:30:00

Answer: B

# 2. Date comparisons
### Exercises
When working with timestamps, sometimes you want to find all observations on a given day. However, if you specify only a date in a comparison, you may get unexpected results. This query:

SELECT count(*) \
  FROM evanston311\
 WHERE date_created = '2018-01-02';
 
returns 0, even though there were 49 requests on January 2, 2018.

This is because dates are automatically converted to timestamps when compared to a timestamp. The time fields are all set to zero:

SELECT '2018-01-02'::timestamp;\
 2018-01-02 00:00:00\
When working with both timestamps and dates, you'll need to keep this in mind.

### task 1
### Instruction
Count the number of Evanston 311 requests created on January 31, 2017 by casting date_created to a date.

In [3]:
%%sql

-- Count requests created on January 31, 2017
SELECT count(*) 
  FROM evanston311
 WHERE date_created::date = '2017-01-31';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(43,)]

### task 2
### Instruction
Count the number of Evanston 311 requests created on February 29, 2016 by using >= and < operators.

In [4]:
%%sql

-- Count requests created on February 29, 2016
SELECT count(*)
  FROM evanston311 
 WHERE date_created >= '2016-02-29' 
   AND date_created < '2016-03-01';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(51,)]

### task 3
### Instruction
- Count the number of requests created on March 13, 2017.
- Specify the upper bound by adding 1 to the lower bound.

In [5]:
%%sql

-- Count requests created on March 13, 2017
SELECT count(*)
  FROM evanston311
 WHERE date_created >= '2017-03-13'
   AND date_created < '2017-03-13'::date + 1;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(32,)]

# 3. Date arithmetic
### Exercises
You can subtract dates or timestamps from each other.

You can add time to dates or timestamps using intervals. An interval is specified with a number of units and the name of a datetime field. For example:

'3 days'::interval
'6 months'::interval
'1 month 2 years'::interval
'1 hour 30 minutes'::interval
Practice date arithmetic with the Evanston 311 data and now().

### task 1
### Instruction
Subtract the minimum date_created from the maximum date_created.

In [6]:
%%sql

-- Subtract the min date_created from the max
SELECT max(date_created) - min(date_created)
  FROM evanston311;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(datetime.timedelta(days=911, seconds=59619),)]

### task 2
### Instruction
Using now(), find out how old the most recent evanston311 request was created.

In [7]:
%%sql

-- How old is the most recent request?
SELECT now() - max(date_created)
  FROM evanston311;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(datetime.timedelta(days=1649, seconds=46780, microseconds=908469),)]

### task 3
### Instruction
Add 100 days to the current timestamp.

In [8]:
%%sql

-- Add 100 days to the current timestamp
SELECT now() + '100 days'::interval;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(datetime.datetime(2023, 4, 15, 12, 36, 20, 729534, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))),)]

### task 4
### Instruction
Select the current timestamp and the current timestamp plus 5 minutes.

In [9]:
%%sql

-- Select the current timestamp, 
-- and the current timestamp + 5 minutes
SELECT now() + '5 minutes'::interval;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(datetime.datetime(2023, 1, 5, 12, 41, 41, 892944, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))),)]

# 4. Completion time by category
### Exercises
The evanston311 data includes a date_created timestamp from when each request was created and a date_completed timestamp for when it was completed. The difference between these tells us how long a request was open.

Which category of Evanston 311 requests takes the longest to complete?

### Instructions
- Compute the average difference between the completion timestamp and the creation timestamp by category.
- Order the results with the largest average time to complete the request first.

In [11]:
%%sql

-- Select the category and the average completion time by category
SELECT category, 
       avg(date_completed - date_created) AS completion_time
  FROM evanston311
 GROUP BY category
-- Order the results
 ORDER BY completion_time DESC
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Rodents- Rats', datetime.timedelta(days=64, seconds=39503, microseconds=766)),
 ('Fire Prevention - Public Education', datetime.timedelta(days=34, seconds=60490)),
 ('Key Request - All  City Employees', datetime.timedelta(days=32, seconds=3131)),
 ('Smoking', datetime.timedelta(days=27, seconds=27750, microseconds=238095)),
 ('Notice of Violation', datetime.timedelta(days=24, seconds=20472, microseconds=666667)),
 ('Exterior Conditions', datetime.timedelta(days=23, seconds=80311, microseconds=87719)),
 ('General/Routine Maintenance - Facilities Management', datetime.timedelta(days=23, seconds=10916, microseconds=480000)),
 ('Trash - Special Pickup (STAFF ONLY)', datetime.timedelta(days=19, seconds=21892, microseconds=96070)),
 ('Public Transit Agency Issue', datetime.timedelta(days=19, seconds=12495, microseconds=845070)),
 ('Private Utility Service Issue', datetime.timedelta(days=17, seconds=71413, microseconds=130000))]

# 5. Date parts
### Exercises
The date_part() function is useful when you want to aggregate data by a unit of time across multiple larger units of time. For example, aggregating data by month across different years, or aggregating by hour across different days.

Recall that you use date_part() as:

SELECT date_part('field', timestamp);

In this exercise, you'll use date_part() to gain insights about when Evanston 311 requests are submitted and completed.

### task 1
### Instruction
How many requests are created in each of the 12 months during 2016-2017?

In [12]:
%%sql

-- Extract the month from date_created and count requests
SELECT date_part('month', date_created) AS month, 
       count(*)
  FROM evanston311
 -- Limit the date range
 WHERE date_created >= '2016-01-01'
   AND date_created < '2018-01-01'
 -- Group by what to get monthly counts?
 GROUP BY month;

 * postgresql://postgres:***@localhost:2828/datacamp
12 rows affected.

[(6.0, 3401),
 (8.0, 3106),
 (4.0, 2385),
 (3.0, 2175),
 (5.0, 2670),
 (10.0, 2403),
 (11.0, 2281),
 (9.0, 2764),
 (12.0, 2005),
 (1.0, 1805),
 (2.0, 1773),
 (7.0, 3064)]

### task 2
### Instruction
What is the most common hour of the day for requests to be created?

In [13]:
%%sql

-- Get the hour and count requests
SELECT date_part('hour', date_created) AS hour,
       count(*)
  FROM evanston311
 GROUP BY hour
 -- Order results to select most common
 ORDER BY count DESC
 LIMIT 1;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(16.0, 4089)]

### task 3
### Instruction
- During what hours are requests usually completed? Count requests completed by hour.
- Order the results by hour.

In [14]:
%%sql

-- Count requests completed by hour
SELECT date_part('hour', date_completed) AS hour,
       count(*)
  FROM evanston311
 GROUP BY hour
 ORDER BY hour;

 * postgresql://postgres:***@localhost:2828/datacamp
24 rows affected.

[(0.0, 428),
 (1.0, 204),
 (2.0, 131),
 (3.0, 101),
 (4.0, 124),
 (5.0, 69),
 (6.0, 50),
 (7.0, 13),
 (8.0, 10),
 (9.0, 11),
 (10.0, 19),
 (11.0, 9),
 (12.0, 50),
 (13.0, 1296),
 (14.0, 1870),
 (15.0, 2516),
 (16.0, 2744),
 (17.0, 3162),
 (18.0, 3351),
 (19.0, 3580),
 (20.0, 4787),
 (21.0, 5059),
 (22.0, 5242),
 (23.0, 1605)]

# 6. Variation by day of week
### Exercises
Does the time required to complete a request vary by the day of the week on which the request was created?

We can get the name of the day of the week by converting a timestamp to character data:

to_char(date_created, 'day') \
But character names for the days of the week sort in alphabetical, not chronological, order. To get the chronological order of days of the week with an integer value for each day, we can use:

EXTRACT(DOW FROM date_created)\
DOW stands for "day of week."

### Instructions
- Select the name of the day of the week the request was created (date_created) as day.
- Select the mean time between the request completion (date_completed) and request creation as duration.
- Group by day (the name of the day of the week) and the integer value for the day of the week (use a function).
- Order by the integer value of the day of the week using the same function used in GROUP BY.

In [15]:
%%sql

-- Select name of the day of the week the request was created 
SELECT to_char(date_created, 'day') AS day, 
       -- Select avg time between request creation and completion
       AVG(date_completed - date_created) AS duration
  FROM evanston311 
 -- Group by the name of the day of the week and 
 -- integer value of day of week the request was created
 GROUP BY day, EXTRACT(day FROM now())
 -- Order by integer value of the day of the week 
 -- the request was created
 ORDER BY EXTRACT(day FROM now());

 * postgresql://postgres:***@localhost:2828/datacamp
7 rows affected.

[('friday   ', datetime.timedelta(days=8, seconds=10991, microseconds=749761)),
 ('monday   ', datetime.timedelta(days=7, seconds=2079, microseconds=376618)),
 ('saturday ', datetime.timedelta(days=8, seconds=30552, microseconds=146141)),
 ('sunday   ', datetime.timedelta(days=7, seconds=58358, microseconds=965567)),
 ('thursday ', datetime.timedelta(days=7, seconds=35964, microseconds=505715)),
 ('tuesday  ', datetime.timedelta(days=7, seconds=31499, microseconds=635073)),
 ('wednesday', datetime.timedelta(days=7, seconds=34044, microseconds=291390))]

# 7. Date truncation
### Instruction
Unlike date_part() or EXTRACT(), date_trunc() keeps date/time units larger than the field you specify as part of the date. So instead of just extracting one component of a timestamp, date_trunc() returns the specified unit and all larger ones as well.

Recall the syntax:

date_trunc('field', timestamp)\
Using date_trunc(), find the average number of Evanston 311 requests created per day for each month of the data. Ignore days with no requests when taking the average.

### Instructions
- Write a subquery to count the number of requests created per day.
- Select the month and average count per month from the daily_count subquery.

In [16]:
%%sql

-- Aggregate daily counts by month
SELECT date_trunc('month', day) AS month,
       avg(count)
  -- Subquery to compute daily counts
  FROM (SELECT date_trunc('day', date_created) AS day,
               count(*) AS count
          FROM evanston311
         GROUP BY day) AS daily_count
 GROUP BY month
 ORDER BY month;

 * postgresql://postgres:***@localhost:2828/datacamp
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('24.2333333333333333')),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('30.5517241379310345')),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.7096774193548387')),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('37.2666666666666667')),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('39.4516129032258065')),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('43.8333333333333333')),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('41.7096774193548387')),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('46.3870967741935484')),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('47.2666666666666667')),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.9677419354838710')),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('36.6551724137931034')),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('30.3666666666666667')),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('34.7741935483870968')),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('31.6785714285714286')),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.6000000000000000')),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('42.2333333333333333')),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('46.6774193548387097')),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('69.5333333333333333')),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('57.1290322580645161')),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('53.8064516129032258')),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('44.8666666666666667')),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('41.5483870967741935')),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('40.6000000000000000')),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.2903225806451613')),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('34.2666666666666667')),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('30.3214285714285714')),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('29.9032258064516129')),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.0666666666666667')),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('45.1290322580645161')),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('44.8000000000000000'))]

# 8.Find missing dates
### Exercises
The generate_series() function can be useful for identifying missing dates.

Recall:

generate_series(from, to, interval)\
where from and to are dates or timestamps, and interval can be specified as a string with a number and a unit of time, such as '1 month'.

Are there any days in the Evanston 311 data where no requests were created?

### Instructions
- Write a subquery using generate_series() to get all dates between the min() and max() date_created in evanston311.
- Write another subquery to select all values of date_created as dates from evanston311.
- Both subqueries should produce values of type date (look for the ::).
- Select dates (day) from the first subquery that are NOT IN the results of the second subquery. This gives you days that are not in date_created.

In [17]:
%%sql

SELECT day
-- 1) Subquery to generate all dates
-- from min to max date_created
  FROM (SELECT generate_series(min(date_created),
                               max(date_created),
                               '1 day')::date AS day
          -- What table is date_created in?
          FROM evanston311) AS all_dates
-- 4) Select dates (day from above) that are NOT IN the subquery
 WHERE day NOT IN 
       -- 2) Subquery to select all date_created values as dates
       (SELECT date_created::date
          FROM evanston311);

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[(datetime.date(2016, 1, 10),),
 (datetime.date(2016, 11, 20),),
 (datetime.date(2016, 12, 11),),
 (datetime.date(2017, 3, 12),),
 (datetime.date(2018, 1, 7),)]

# 9. ustom aggregation periods
### Exercises
Find the median number of Evanston 311 requests per day in each six month period from 2016-01-01 to 2018-06-30. Build the query following the three steps below.

Recall that to aggregate data by non-standard date/time intervals, such as six months, you can use generate_series() to create bins with lower and upper bounds of time, and then summarize observations that fall in each bin.

Remember: you can access the slides with an example of this type of query using the PDF icon link in the upper right corner of the screen.

### task 1
### Instructions
- Use generate_series() to create bins of 6 month intervals. Recall that the upper bin values are exclusive, so the values need to be one day greater than the last day to be included in the bin.
- Notice how in the sample code, the first bin value of the upper bound is July 1st, and not June 30th.
- Use the same approach when creating the last bin values of the lower and upper bounds (i.e. for 2018).

In [18]:
%%sql

-- Generate 6 month bins covering 2016-01-01 to 2018-06-30

-- Create lower bounds of bins
SELECT generate_series('2016-01-01',  -- First bin lower value
                       '2018-01-01',  -- Last bin lower value
                       '6 months'::interval) AS lower,
-- Create upper bounds of bins
       generate_series('2016-07-01',  -- First bin upper value
                       '2018-07-01',  -- Last bin upper value
                       '6 months'::interval) AS upper;

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200)))),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200)))),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200)))),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200)))),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2018, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))))]

### task 2
### Instruction
- Count the number of requests created per day. Remember to not count *, or you will risk counting NULL values.
- Include days with no requests by joining evanston311 to a daily series from 2016-01-01 to 2018-06-30.

`Note that because we are not generating bins, you can use June 30th as your series end date.`

In [20]:
%%sql

-- Count number of requests made per day 
SELECT day, count(date_created) AS count
-- Use a daily series from 2016-01-01 to 2018-06-30 
-- to include days with no requests
  FROM (SELECT generate_series('2016-01-01',  -- series start date
                               '2018-06-30',  -- series end date
                               '1 day'::interval)::date AS day) AS daily_series
       LEFT JOIN evanston311
       -- match day from above (which is a date) to date_created
       ON day = date_created::date
 GROUP BY day
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(datetime.date(2016, 1, 1), 5),
 (datetime.date(2016, 1, 2), 21),
 (datetime.date(2016, 1, 3), 12),
 (datetime.date(2016, 1, 4), 55),
 (datetime.date(2016, 1, 5), 31),
 (datetime.date(2016, 1, 6), 47),
 (datetime.date(2016, 1, 7), 33),
 (datetime.date(2016, 1, 8), 30),
 (datetime.date(2016, 1, 9), 19),
 (datetime.date(2016, 1, 10), 0)]

### task 3
### Instruction
- Assign each daily count to a single 6 month bin by joining bins to daily_counts.
- Compute the median value per bin using percentile_disc().

In [21]:
%%sql

-- Bins from Step 1
WITH bins AS (
	 SELECT generate_series('2016-01-01',
                            '2018-01-01',
                            '6 months'::interval) AS lower,
            generate_series('2016-07-01',
                            '2018-07-01',
                            '6 months'::interval) AS upper),
-- Daily counts from Step 2
     daily_counts AS (
     SELECT day, count(date_created) AS count
       FROM (SELECT generate_series('2016-01-01',
                                    '2018-06-30',
                                    '1 day'::interval)::date AS day) AS daily_series
            LEFT JOIN evanston311
            ON day = date_created::date
      GROUP BY day)
-- Select bin bounds
SELECT lower, 
       upper, 
       -- Compute median of count for each bin
       percentile_disc(0.5) WITHIN GROUP (ORDER BY count) AS median
  -- Join bins and daily_counts
  FROM bins
       LEFT JOIN daily_counts
       -- Where the day is between the bin bounds
       ON day >= lower
          AND day < upper
 -- Group by bin bounds
 GROUP BY lower, upper
 ORDER BY lower;

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 37),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 41),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 43),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 52),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2018, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 40)]

# 10. Monthly average with missing dates
### Exercises
Find the average number of Evanston 311 requests created per day for each month of the data.

This time, do not ignore dates with no requests.

### Instructions
- Generate a series of dates from 2016-01-01 to 2018-06-30.
- Join the series to a subquery to count the number of requests created per day.
- Use date_trunc() to get months from date, which has all dates, NOT day.
- Use coalesce() to replace NULL count values with 0. Compute the average of this value.

In [22]:
%%sql

-- generate series with all days from 2016-01-01 to 2018-06-30
WITH all_days AS 
     (SELECT generate_series('2016-01-01',
                             '2018-06-30',
                             '1 day'::interval) AS date),
     -- Subquery to compute daily counts
     daily_count AS 
     (SELECT date_trunc('day', date_created) AS day,
             count(*) AS count
        FROM evanston311
       GROUP BY day)
-- Aggregate daily counts by month using date_trunc
SELECT date_trunc('month', date) AS month,
       -- Use coalesce to replace NULL count values with 0
       avg(coalesce(count, 0)) AS average
  FROM all_days
       LEFT JOIN daily_count
       -- Joining condition
       ON all_days.date=daily_count.day
 GROUP BY month
 ORDER BY month;

 * postgresql://postgres:***@localhost:2828/datacamp
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('23.4516129032258065')),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('30.5517241379310345')),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.7096774193548387')),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('37.2666666666666667')),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('39.4516129032258065')),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('43.8333333333333333')),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('41.7096774193548387')),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('46.3870967741935484')),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('47.2666666666666667')),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.9677419354838710')),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.4333333333333333')),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('29.3870967741935484')),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('34.7741935483870968')),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('31.6785714285714286')),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('34.4516129032258065')),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('42.2333333333333333')),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('46.6774193548387097')),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('69.5333333333333333')),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('57.1290322580645161')),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('53.8064516129032258')),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('44.8666666666666667')),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('41.5483870967741935')),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('40.6000000000000000')),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.2903225806451613')),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('33.1612903225806452')),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('30.3214285714285714')),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('29.9032258064516129')),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('35.0666666666666667')),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('45.1290322580645161')),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), Decimal('44.8000000000000000'))]

# 11, Longest gap
### Exercises
What is the longest time between Evanston 311 requests being submitted?

Recall the syntax for lead() and lag():

lag(column_to_adjust) OVER (ORDER BY ordering_column)\
lead(column_to_adjust) OVER (ORDER BY ordering_column)

### Instructions
- Select date_created and the date_created of the previous request using lead() or lag() as appropriate.
- Compute the gap between each request and the previous request.
- Select the row with the maximum gap.

In [23]:
%%sql

-- Compute the gaps
WITH request_gaps AS (
        SELECT date_created,
               -- lead or lag
               lag(date_created) OVER (ORDER BY date_created) AS previous,
               -- compute gap as date_created minus lead or lag
               date_created - lag(date_created) OVER (ORDER BY date_created) AS gap
          FROM evanston311)
-- Select the row with the maximum gap
SELECT *
  FROM request_gaps
-- Subquery to select maximum gap from request_gaps
 WHERE gap = (SELECT max(gap)
                FROM request_gaps);

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(datetime.datetime(2018, 1, 8, 1, 41, 34, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2018, 1, 6, 1, 4, 9, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.timedelta(days=2, seconds=2245))]

# 12. Rats!
### Exercises
Requests in category "Rodents- Rats" average over 64 days to resolve. Why?

Investigate in 4 steps:
1. Why is the average so high? Check the distribution of completion times. Hint: date_trunc() can be used on intervals.
2. See how excluding outliers influences average completion times.
3. Do requests made in busy months take longer to complete? Check the correlation between the average completion time and requests per month.
4. Compare the number of requests created per month to the number completed.

Remember: the time to resolve, or completion time, is date_completed - date_created.

### task1
### Instruction
Use date_trunc() to examine the distribution of rat request completion times by number of days.

In [24]:
%%sql

-- Truncate the time to complete requests to the day
SELECT date_trunc('day', date_completed - date_created) AS completion_time,
-- Count requests with each truncated time
       count(*)
  FROM evanston311
-- Where category is rats
 WHERE category = 'Rodents- Rats'
-- Group and order by the variable of interest
 GROUP BY completion_time
 ORDER BY completion_time
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(datetime.timedelta(0), 73),
 (datetime.timedelta(days=1), 17),
 (datetime.timedelta(days=2), 23),
 (datetime.timedelta(days=3), 11),
 (datetime.timedelta(days=4), 6),
 (datetime.timedelta(days=5), 6),
 (datetime.timedelta(days=6), 5),
 (datetime.timedelta(days=7), 7),
 (datetime.timedelta(days=8), 6),
 (datetime.timedelta(days=9), 10)]

### task 2
### Instruction
Compute average completion time per category excluding the longest 5% of requests (outliers).

In [25]:
%%sql

SELECT category, 
       -- Compute average completion time per category
       avg(date_completed - date_created) AS avg_completion_time
  FROM evanston311
-- Where completion time is less than the 95th percentile value
 WHERE date_completed - date_created < 
-- Compute the 95th percentile of completion time in a subquery
         (SELECT percentile_disc(0.95) WITHIN GROUP (ORDER BY date_completed - date_created)
            FROM evanston311)
 GROUP BY category
-- Order the results
 ORDER BY avg_completion_time DESC
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Trash Cart - Downsize, Upsize or Remove', datetime.timedelta(days=12, seconds=64070, microseconds=586912)),
 ('Sanitation Billing Questions', datetime.timedelta(days=12, seconds=40405, microseconds=888889)),
 ('THIS REQUEST IS INACTIVE...Trash Cart - Compost Bin', datetime.timedelta(days=12, seconds=23562, microseconds=24390)),
 ('Trash, Recycling, Yard Waste Cart- Repair/Replacement', datetime.timedelta(days=11, seconds=67707, microseconds=488108)),
 ('Rodents- Rats', datetime.timedelta(days=11, seconds=32280, microseconds=840849)),
 ('Landmark Building Plaque or Nomination', datetime.timedelta(days=11, seconds=18671, microseconds=666667)),
 ('Notice of Violation', datetime.timedelta(days=10, seconds=70129, microseconds=142858)),
 ('Move Out- Special Pickup', datetime.timedelta(days=10, seconds=28620, microseconds=500000)),
 ('Long Term Care', datetime.timedelta(days=9, seconds=83529)),
 ('Smoking', datetime.timedelta(days=8, seconds=83706, microseconds=611111))]

### task 3
### Instruction
Get corr() between avg. completion time and monthly requests. EXTRACT(epoch FROM interval) returns seconds in interval.

In [26]:
%%sql

-- Compute correlation (corr) between 
-- avg_completion time and count from the subquery
SELECT corr(avg_completion, count)
  -- Convert date_created to its month with date_trunc
  FROM (SELECT date_trunc('month', date_created) AS month, 
               -- Compute average completion time in number of seconds           
               avg(EXTRACT(epoch FROM date_completed - date_created)) AS avg_completion, 
               -- Count requests per month
               count(*) AS count
          FROM evanston311
         -- Limit to rodents
         WHERE category='Rodents- Rats' 
         -- Group by month, created above
         GROUP BY month) 
         -- Required alias for subquery 
         AS monthly_avgs;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(0.24670605475134183,)]

### task 4
### Instruction
Select the number of requests created and number of requests completed per month.

In [27]:
%%sql

-- Compute monthly counts of requests created
WITH created AS (
       SELECT date_trunc('month', date_created) AS month,
              count(*) AS created_count
         FROM evanston311
        WHERE category='Rodents- Rats'
        GROUP BY month),
-- Compute monthly counts of requests completed
      completed AS (
       SELECT date_trunc('month', date_completed) AS month,
              count(*) AS completed_count
         FROM evanston311
        WHERE category='Rodents- Rats'
        GROUP BY month)
-- Join monthly created and completed counts
SELECT created.month, 
       created_count, 
       completed_count
  FROM created
       INNER JOIN completed
       ON created.month=completed.month
 ORDER BY created.month;

 * postgresql://postgres:***@localhost:2828/datacamp
30 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10, 1),
 (datetime.datetime(2016, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 22, 11),
 (datetime.datetime(2016, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 31, 14),
 (datetime.datetime(2016, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 36, 16),
 (datetime.datetime(2016, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 40, 19),
 (datetime.datetime(2016, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 41, 49),
 (datetime.datetime(2016, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 80, 47),
 (datetime.datetime(2016, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 79, 43),
 (datetime.datetime(2016, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 55, 58),
 (datetime.datetime(2016, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 77, 67),
 (datetime.datetime(2016, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 63, 61),
 (datetime.datetime(2016, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20, 83),
 (datetime.datetime(2017, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 16, 34),
 (datetime.datetime(2017, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20, 30),
 (datetime.datetime(2017, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 24, 32),
 (datetime.datetime(2017, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 42, 14),
 (datetime.datetime(2017, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 51, 17),
 (datetime.datetime(2017, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 65, 34),
 (datetime.datetime(2017, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 68, 46),
 (datetime.datetime(2017, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 86, 53),
 (datetime.datetime(2017, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 55, 70),
 (datetime.datetime(2017, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 78, 12),
 (datetime.datetime(2017, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 44, 174),
 (datetime.datetime(2017, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 12, 65),
 (datetime.datetime(2018, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 19, 45),
 (datetime.datetime(2018, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 9, 10),
 (datetime.datetime(2018, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 29, 27),
 (datetime.datetime(2018, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 35, 23),
 (datetime.datetime(2018, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 46, 47),
 (datetime.datetime(2018, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 52, 55)]